benchmark_results_replicated/20260803_085536/analysis/rep1/run/rust_c25/wrk_output.txt
Running 1m test @ http://localhost:8081/days-since
  4 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.00ms  156.35us   5.26ms   70.53%
    Req/Sec     5.95k   139.05     6.47k    74.25%
  Latency Distribution
     50%    1.01ms
     75%    1.10ms
     90%    1.19ms
     99%    1.35ms
  1423713 requests in 1.00m, 172.44MB read
Requests/sec:  23689.14
Transfer/sec:      2.87MB
P95: 1244
P99: 1348